#При игре в города игроки по очереди называют названия городов (или, возможно, любые другие слова) так, чтобы первая буква каждого нового слова совпадала
#с последней буквой предыдущего. Иногда при этом считают, что если последняя буква предыдущего слова — мягкий знак, то с первой буквой следующего слова надо сравнивать букву,
#предшествующую мягкому знаку. Напишите программу, которая считывает подряд две строки, после чего выводит «ВЕРНО», если последний символ первой строки совпадает
#с первым символом второй (с учётом правила про мягкий знак), и «НЕВЕРНО» в противном случае.
word1 = input()
word2 = input()
if word1[-1] == 'ь' and word1[-2] == word2[0]:
    print('ВЕРНО')
elif word1[-1] == word2[0]:
    print('ВЕРНО')
else:
    print('НЕВЕРНО')
